#### DocumentValidation Members

---

|  |
| --- |
| DocumentValidation Class   Methods   See Also |

The  DocumentValidation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanDeleteElement | Indicates if an element can be deleted. |

# See Also

DocumentValidation Class

Autodesk.Revit.DB Namespace